<?php
define('JINRO_ROOT', '../..');
require_once(JINRO_ROOT . '/include/init.php');
$INIT_CONF->LoadFile('info_functions');
OutputInfoPageHeader('過去の Information', 1);
?>
<!-- Information の改訂履歴を残したい場合はこのページを使用してください -->
<h2>Ver. 1.5.0 β4 アップロード (2011/06/25 (Sat) 05:46)</h2>
<ul>
  <li>「求道者」「山わろ」「がしゃどくろ」「狂骨」「麒麟」「身代わり地蔵」<br>「夜刀神」「羊飼い」「剣闘士」実装</li>
  <li>サブ役職「元求道者」「一日村長」「羊」「羊皮」実装</li>
</ul>

<h2>Ver. 1.5.0 β3 アップロード (2011/06/18 (Sat) 00:11)</h2>
<ul>
  <li>「黒幕」「復讐者」「後援者」実装</li>
  <li>サブ役職「無精者」「わらしべ長者」「没落者」「燕返し」「脱落者」「仇敵」「受援者」実装</li>
</ul>

<h2>Ver. 1.5.0 β2 アップロード (2011/05/27 (Fri) 18:42)</h2>
<ul>
  <li>「人馬」「首領」実装</li>
  <li>固定追加配役モード：K(覚醒村)追加</li>
</ul>

<h2>Ver. 1.5.0 β1 アップロード (2011/05/13 (Fri) 02:49)</h2>
<ul>
  <li>「大妖精」「吟遊詩人」「紅天使」「決闘者」「戦乙女」「舞首」実装</li>
  <li>サブ役職「宿敵」実装</li>
  <li>固定追加配役モード：I(恋人村)・J(宿敵村)追加</li>
</ul>

<h2>Ver. 1.5.0 α9 アップロード (2011/05/02 (Mon) 02:19)</h2>
<ul>
  <li>「水妖姫」「半鳥女」「殉教者」「半鳥女」実装</li>
  <li>サブ役職「能力発現」実装</li>
  <li>天候「雪明り」「蛍火」「日蝕」「月蝕」「宵闇」「白夜」「極光」実装</li>
</ul>

<h2>Ver. 1.5.0 α8 アップロード (2011/04/23 (Sat) 05:09)</h2>
<ul>
  <li>「左道使い」「道化師」「狡狐」「狡狼」実装</li>
  <li>天候「濃霧」「台風」「萌動」「蜃気楼」「紅月」「砂塵嵐」「霧雨」「木枯らし」実装</li>
  <li>天候確率変動システム実装</li>
</ul>

<h2>Ver. 1.5.0 α7 アップロード (2011/04/09 (Sat) 02:54)</h2>
<ul>
  <li>「夜叉丸」「滝夜叉姫」「迷い人」「門番」「萌蝙蝠」実装</li>
  <li>固定追加配役モード：G(嘘吐村)・H(村人村)追加</li>
</ul>

<h2>Ver. 1.5.0 α6 アップロード (2011/03/27 (Sun) 03:54)</h2>
<ul>
  <li>「仙狼」「結界師」「精神感応者」「交霊術師」実装</li>
  <li>憑依中の憑依能力者が処刑された時に憑依先の能力が発動することがあるバグを修正</li>
</ul>

<h2>Ver. 1.5.0 α5 アップロード (2011/03/10 (Thu) 21:37)</h2>
<ul>
  <li>「舟幽霊」「黒衣」「釣瓶落とし」「八咫烏」実装</li>
  <li>サブ役職「入道」実装</li>
</ul>

<h2>Ver. 1.5.0 α4 アップロード (2011/02/18 (Fri) 05:06)</h2>
<ul>
  <li>「比丘尼」「祈祷師」実装</li>
  <li>天候「波風」「小夜嵐」「流星群」「春時雨」「木漏れ日」「疎雨」「川霧」「蒼天」<br>
    「雪」「梅雨」「雹」「半月」「曇天」「箒星」「旱魃」実装
  </li>
</ul>
</body></html>
