<?php
define('JINRO_ROOT', '../..');
require_once(JINRO_ROOT . '/include/init.php');
$INIT_CONF->LoadFile('info_functions');
OutputInfoPageHeader('過去の Information', 1);
?>
<!-- Information の改訂履歴を残したい場合はこのページを使用してください -->
<h2>Ver. 1.5.0 α5 アップロード (2011/03/10 (Thu) 21:37)</h2>
<ul>
  <li>「舟幽霊」「黒衣」「釣瓶落とし」「八咫烏」実装</li>
  <li>サブ役職「入道」実装</li>
</ul>

<h2>Ver. 1.5.0 α4 アップロード (2011/02/18 (Fri) 05:06)</h2>
<ul>
  <li>「比丘尼」「祈祷師」実装</li>
  <li>天候「波風」「小夜嵐」「流星群」「春時雨」「木漏れ日」「疎雨」「川霧」「蒼天」<br>
    「雪」「梅雨」「雹」「半月」「曇天」「箒星」「旱魃」実装
  </li>
</ul>

<h2>Ver. 1.5.0 α3 アップロード (2011/02/04 (Fri) 04:03)</h2>
<ul>
  <li>「死化粧師」「密偵」実装</li>
  <li>天候「黄砂」「虹」「ダイヤモンドダスト」「バナナの皮」「スポットライト」「タライ」<br>
    「凪」「青天の霹靂」「涙雨」「熱帯夜」「朧月」「叢雲」「雷雨」「快晴」「慈雨」実装
  </li>
</ul>

<h2>Ver. 1.5.0 α2 アップロード (2011/01/21 (Fri) 07:38)</h2>
<ul>
  <li>ゲームオプション「天候あり」実装</li>
</ul>

<h2>Ver. 1.5.0 α1 アップロード (2011/01/15 (Sat) 09:16)</h2>
<ul>
  <li>「魔法使い」「八卦見」実装</li>
</ul>

<h2>Ver. 1.3.1 アップロード (2011/01/09 (Sun) 02:34)</h2>
<ul>
  <li>PHPの浮動小数点数に関するバグに対応</li>
</ul>

<h2>Ver. 1.4.1 アップロード (2011/01/09 (Sun) 00:57)</h2>
<ul>
  <li>PHPの浮動小数点数に関するバグに対応</li>
</ul>

<h2>Ver. 1.4.0 アップロード (2010/12/24 (Fri) 03:23)</h2>
<ul>
<li>バージョン情報表記の改訂</li>
</ul>

<h2>Ver. 1.4.0 RC2 アップロード : 2010/12/17 (Fri) 02:42</h2>
<ul>
<li>「異議」あり音源の差し替え</li>
<li>出題者に決定能力を追加</li>
</ul>

<h2>Ver. 1.4.0 RC1 アップロード : 2010/12/11 (Sat) 04:14</h2>
<ul>
  <li>固定追加配役モード：ランダム枠の実装、F(鬼村)追加</li>
</ul>

<h2>Ver. 1.4.0 β21 アップロード (2010/11/23 (Tue) 14:14)</h2>
<ul>
  <li>「毘沙門天」「星熊童子」「大司祭」「神主」「和蘭人形」「露西亜人形」「紅蝙蝠」実装</li>
  <li>サブ役職「ジョーカー」実装</li>
  <li>「ババ抜き村」オプション実装</li>
</ul>

<h2>Ver. 1.4.0 β20 アップロード (2010/11/12 (Fri) 03:21)</h2>
<ul>
  <li>「蟲姫」「酒呑童子」「祟神」「蛇神」「倫敦人形」「西蔵人形」「影妖精」実装</li>
  <li>サブ役職「洗脳者」実装</li>
</ul>

<h2>Ver. 1.4.0 β19 アップロード (2010/10/31 (Sun) 01:22)</h2>
<ul>
  <li>「固定追加配役モード」オプション実装</li>
  <li>「縁切地蔵」「榊鬼」「冥血鬼」「吸血姫」「傘化け」<br>
    「金鬼」「風鬼」「水鬼」「隠行鬼」「夜叉」「般若」「荼枳尼天」実装</li>
</ul>
</body></html>
