<?php
define('JINRO_ROOT', '../..');
require_once(JINRO_ROOT . '/include/init.php');
$INIT_CONF->LoadFile('info_functions');
OutputInfoPageHeader('過去の Information', 1);
?>
<!-- Information の改訂履歴を残したい場合はこのページを使用してください -->
<h2>Ver. 1.5.0 β11 アップロード (2011/08/25 (Thu) 23:28)</h2>
<ul>
  <li>「デスノート村」オプション実装</li>
  <li>「おしら様」「常世神」実装</li>
  <li>サブ役職「オシラ遊び」「デスノート」実装</li>
</ul>

<h2>Ver. 1.5.0 β10 アップロード (2011/08/20 (Sat) 02:49)</h2>
<ul>
  <li>「狂人村」「出題者村」「吸血鬼村」「鵺村」「殉教者村」「共有者置換村」オプション実装</li>
  <li>「隠者」「鬼子母神」「暴君」「静狼」「賢者」実装</li>
</ul>

<h2>Ver. 1.5.0 β9 アップロード (2011/08/11 (Thu) 02:09)</h2>
<ul>
  <li>「指導者」「狙毒者」「萌占い師」「蝕巫女」「阿修羅」「夜行鬼」「蛇姫」「人魚」実装</li>
  <li>サブ役職制限：HARDモード追加</li>
  <li>出現率変動モード：D(封蘇村)・E(封憑村)追加</li>
</ul>

<h2>Ver. 1.5.0 β8 アップロード (2011/07/31 (Sun) 06:43)</h2>
<ul>
  <li>「傀儡師」「老兵」「寒戸婆」「堕天使」実装</li>
  <li>固定配役追加モード：L(白銀村)追加</li>
  <li>出現率変動モード：C(派生村)追加</li>
</ul>

<h2>Ver. 1.5.0 β7 アップロード (2011/07/23 (Sat) 05:03)</h2>
<ul>
  <li>「出現率変動モード」オプション実装</li>
  <li>「火狼」「宙狐」「霧狼」「霧狐」実装</li>
  <li>サブ役職「鬼火」「天火」「狐火」「古戦場火」「松明丸」実装</li>
</ul>

<h2>Ver. 1.5.0 β6 アップロード (2011/07/09 (Sat) 05:23)</h2>
<ul>
  <li>「狂人置換村」「狂信者村」「囁き狂人村」オプション実装</li>
  <li>「家神」「屍鬼」「草履大将」「未亡人」「無鉄砲者」「ひんな神」「恋妖精」実装</li>
  <li>サブ役職「ひんな持ち」「悲恋」実装</li>
</ul>

<h2>Ver. 1.5.0 β5 アップロード (2011/06/27 (Mon) 20:18)</h2>
<ul>
  <li>「裏・闇鍋モード」オプション実装</li>
</ul>

<h2>Ver. 1.5.0 β4 アップロード (2011/06/25 (Sat) 05:46)</h2>
<ul>
  <li>「求道者」「山わろ」「がしゃどくろ」「狂骨」「麒麟」「身代わり地蔵」<br>「夜刀神」「羊飼い」「剣闘士」実装</li>
  <li>サブ役職「元求道者」「一日村長」「羊」「羊皮」実装</li>
</ul>

<h2>Ver. 1.5.0 β3 アップロード (2011/06/18 (Sat) 00:11)</h2>
<ul>
  <li>「黒幕」「復讐者」「後援者」実装</li>
  <li>サブ役職「無精者」「わらしべ長者」「没落者」「燕返し」「脱落者」「仇敵」「受援者」実装</li>
</ul>

<h2>Ver. 1.5.0 β2 アップロード (2011/05/27 (Fri) 18:42)</h2>
<ul>
  <li>「人馬」「首領」実装</li>
  <li>固定追加配役モード：K(覚醒村)追加</li>
</ul>
</body></html>
