<?php
define('JINRO_ROOT', '../..');
require_once(JINRO_ROOT . '/include/init.php');
OutputInfoPageHeader('過去の Information', 1);
?>

<h2>Ver. 1.4.0 β16 アップロード (2010/08/22 (Sun) 05:01:41)</h2>
<ul>
  <li>システムの文字コードを UTF-8 に変更。</li>
  <li>「白澤」「雪女」「氷妖精」実装</li>
</ul>

<h2>Ver. 1.4.0 β15 アップロード (2010/08/12 (Thu) 05:14:33)</h2>
<ul>
  <li>「急所村」オプション実装</li>
  <li>「冥狼」「冥狐」「座敷童子」「探知師」「夢司祭」「仙人」「獣人」実装</li>
</ul>

<h2>Ver. 1.4.0 β14 アップロード (2010/07/29 (Thu) 05:13:05)</h2>
<ul>
  <li>※覚醒者の子狐コピー結果を星狐から月狐に変更してますが同梱の取説は星狐のままとなっています</li>
  <li>「村人置換村」「蝙蝠村」「キューピッド村」「サブ役職制限」オプション実装</li>
  <li>「夜雀」「吸血鬼」、「会心」「痛恨」「囁耳鳴」「吠耳鳴」「爆睡者」<br>
    「役者」「男性恐怖症」「女性恐怖症」実装</li>
</ul>

<h2>Ver. 1.4.0 β13 アップロード (2010/07/17 (Sat) 19:02:15)</h2>
<ul>
  <li>未投票突然死も死亡欄に表示する仕様に変更</li>
  <li>神話マニア系の所属を神話マニア陣営に移動</li>
  <li>巫女の所属を巫女系に移動</li>
  <li>「蓬莱人形」「蟲狐」「月狐」「星狐」「日妖精」「月妖精」「星妖精」「草妖精」<br>
    「猟師」「辻斬り」「封印師」「風祝」実装</li>
</ul>

<h2>Ver. 1.4.0 β12 アップロード (2010/07/11 (Sun) 07:26:40)</h2>
<ul>
  <li>「超・闇鍋モード」「ゲルト君モード」「オープニングあり」オプション実装</a>
  <li>「餓狼」「占星術師」「境界師」「花妖精」実装</li>
</ul>

<h2>Ver. 1.4.0 β11 アップロード (2010/07/06 (Tue) 03:26:47)</h2>
<ul>
  <li>「魂移使」「覚醒者」「夢語部」「幻狼」「幻狐」「逃亡者」「誘毒者」<br>
    「囁騒霊」「吠騒霊」「念騒霊」「かぐや姫」実装</li>
</ul>

<h2>Ver. 1.4.0 β10 アップロード (2010/06/12 (Sat) 19:36:45)</h2>
<ul>
  <li>探偵村実装</li>
  <li>「人形遣い」「上海人形」「鈴蘭人形」「仏蘭西人形」「探偵」「死神」「司教」実装</li>
</ul>

<h2>Ver. 1.4.0 β9 アップロード (2010/05/29 (Sat) 05:29:15)</h2>
<ul>
  <li>Twitter 投稿機能の実装</li>
  <li>BBS 表示機能の実装</li>
  <li>決闘村の配役変更システムの実装</li>
  <li>「執行者」「反魂師」「蝕暗殺者」「河童」「天狼」「土蜘蛛」「犬神」<br>
    「憑狐」「大蝙蝠」「奇術師」「熱病」「自信家」実装
  </li>
  <li>「夢守人」「夢毒者」「獏」「天狐」「妖精系」の仕様変更</li>
</ul>

<h2>Ver. 1.4.0 β8 アップロード (2010/03/28 (Sun) 02:28:28)</h2>
<ul>
  <li>トリップ機能の調整</li>
  <li>入村画面の調整</li>
  <li>「翠狼」「翠狐」「蒼狼」「蒼狐」「金狼」「金狐」「雛狼」「雛狐」<br>
    「天使」「薔薇天使」「百合天使」「大天使」「小悪魔」実装
  </li>
</ul>

<h2>Ver. 1.4.0 β7 アップロード (2010/03/20 (Sat) 20:16:29)</h2>
<ul>
  <li>萌系の変換発動を昼限定に変更</li>
  <li>巫女の恋人後追い判定が正しく出ない事があるバグ修正<br>
    (β6の鵺対応によるエンバグ、誤判定をした場合は「恋人」になる)
  </li>
  <li>サトラレ系の仕様を調整</li>
  <li>蘇生辞退システム実装 (詳細な仕様参照)</li>
  <li>「聖女」「扇動者」「光妖精」「闇妖精」「鏡妖精」実装</li>
</ul>
</body></html>
