<?php
define('JINRO_ROOT', '../..');
require_once(JINRO_ROOT . '/include/init.php');
OutputHTMLHeader($SERVER_CONF->title . '[過去の Information]', 'info');
?>
</head>
<body>
<h1>過去の Information</h1>
<p>
<a href="../../" target="_top">&lt;= TOP</a>
<a href="../" target="_top">←情報一覧</a>
</p>
<h2>ゲームオプション画像セットアップロード (2010/02/18 (Thu) 00:41:10)</h2>
<p>
・Ver. 1.3 〜 Ver. 1.4.0 β3 に対応 (img/room_option をそのまま差し替えてください)
</p>

<h2>Ver. 1.4.0 β3 アップロード (2010/02/16 (Tue) 03:53:55)</h2>
<p>
・自動霊界オフオプションの実装<br>
・呪狼の仕様変更<br>
・色々バグ修正<br>
</p>

<h2>Ver. 1.4.0 β2 アップロード (2010/02/08 (Mon) 03:41:23)</h2>
<p>
・預言者、天人、イタコ、仙狸、仙狐の実装<br>
・猫又、出題者の仕様変更<br>
・再入村リンク表示機能の実装 (設定された時間内、過去ログページに出現します)<br>
</p>

<h2>Ver. 1.4.0 β1 アップロード (2010/02/02 (Tue) 04:25:52)</h2>
<p>
・Ver. 1.4.0 α24 のバグ Fix、設定ファイルの再配置など
</p>

<h2>Ver. 1.4.0 α24 アップロード (2010/01/28 (Thu) 21:29:30)</h2>
<p>
・憑狼・紅狼・賢狼・紅狐・黒狐・司祭の実装、抗毒狼の仕様変更など
</p>

<h2>Ver. 1.4.0 α23 アップロード (2010/01/10 (Sun) 06:11:24)</h2>
<p>
・さとり・銀狼・薬師の仕様変更、鵺・女神の実装など
</p>
</body></html>
