<?php
define('JINRO_ROOT', '../..');
require_once(JINRO_ROOT . '/include/init.php');
OutputInfoPageHeader('過去の Information', 1);
?>
<!-- Information の改訂履歴を残したい場合はこのページを使用してください -->
<h2>Ver. 1.3.1 アップロード (2011/01/09 (Sun) 02:34)</h2>
<ul>
  <li>PHPの浮動小数点数に関するバグに対応</li>
</ul>

<h2>Ver. 1.4.1 アップロード (2011/01/09 (Sun) 00:57)</h2>
<ul>
  <li>PHPの浮動小数点数に関するバグに対応</li>
</ul>

<h2>Ver. 1.4.0 アップロード (2010/12/24 (Fri) 03:23)</h2>
<ul>
<li>バージョン情報表記の改訂</li>
</ul>

<h2>Ver. 1.4.0 RC2 アップロード : 2010/12/17 (Fri) 02:42</h2>
<ul>
<li>「異議」あり音源の差し替え</li>
<li>出題者に決定能力を追加</li>
</ul>

<h2>Ver. 1.4.0 RC1 アップロード : 2010/12/11 (Sat) 04:14</h2>
<ul>
  <li>固定追加配役モード：ランダム枠の実装、F(鬼村)追加</li>
</ul>

<h2>Ver. 1.4.0 β21 アップロード (2010/11/23 (Tue) 14:14)</h2>
<ul>
  <li>「毘沙門天」「星熊童子」「大司祭」「神主」「和蘭人形」「露西亜人形」「紅蝙蝠」実装</li>
  <li>サブ役職「ジョーカー」実装</li>
  <li>「ババ抜き村」オプション実装</li>
</ul>

<h2>Ver. 1.4.0 β20 アップロード (2010/11/12 (Fri) 03:21)</h2>
<ul>
  <li>「蟲姫」「酒呑童子」「祟神」「蛇神」「倫敦人形」「西蔵人形」「影妖精」実装</li>
  <li>サブ役職「洗脳者」実装</li>
</ul>

<h2>Ver. 1.4.0 β19 アップロード (2010/10/31 (Sun) 01:22)</h2>
<ul>
  <li>「固定追加配役モード」オプション実装</li>
  <li>「縁切地蔵」「榊鬼」「冥血鬼」「吸血姫」「傘化け」<br>
    「金鬼」「風鬼」「水鬼」「隠行鬼」「夜叉」「般若」「荼枳尼天」実装</li>
</ul>

<h2>Ver. 1.4.0 β18 アップロード (2010/10/12 (Tue) 04:48)</h2>
<ul>
  <li>「静寂村」「白夜村」「宵闇村」オプション実装</li>
  <li>「守護天使」「影武者」「件」「鬼」「前鬼」「後鬼」「青髭公」「飛縁魔」実装</li>
</ul>

<h2>Ver. 1.4.0 β17 アップロード (2010/10/03 (Sun) 07:08)</h2>
<ul>
  <li>「グレラン村」「早朝待機制」オプション実装</li>
  <li>「狢」「化狐」「恋司祭」「蝕仙狸」「吸血公」実装</li>
  <li>サブ役職「恋色迷彩」実装</li>
</ul>
</body></html>
