<?php
define('JINRO_ROOT', '../..');
require_once(JINRO_ROOT . '/include/init.php');
OutputInfoPageHeader('過去の Information', 1);
?>

<h2>Ver. 1.4.0 β20 アップロード (2010/11/12 (Fri) 03:21)</h2>
<ul>
  <li>「蟲姫」「酒呑童子」「祟神」「蛇神」「倫敦人形」「西蔵人形」「影妖精」実装</li>
  <li>サブ役職「洗脳者」実装</li>
</ul>

<h2>Ver. 1.4.0 β19 アップロード (2010/10/31 (Sun) 01:22)</h2>
<ul>
  <li>「固定追加配役モード」オプション実装</li>
  <li>「縁切地蔵」「榊鬼」「冥血鬼」「吸血姫」「傘化け」<br>
    「金鬼」「風鬼」「水鬼」「隠行鬼」「夜叉」「般若」「荼枳尼天」実装</li>
</ul>

<h2>Ver. 1.4.0 β18 アップロード (2010/10/12 (Tue) 04:48)</h2>
<ul>
  <li>「静寂村」「白夜村」「宵闇村」オプション実装</li>
  <li>「守護天使」「影武者」「件」「鬼」「前鬼」「後鬼」「青髭公」「飛縁魔」実装</li>
</ul>

<h2>Ver. 1.4.0 β17 アップロード (2010/10/03 (Sun) 07:08)</h2>
<ul>
  <li>「グレラン村」「早朝待機制」オプション実装</li>
  <li>「狢」「化狐」「恋司祭」「蝕仙狸」「吸血公」実装</li>
  <li>サブ役職「恋色迷彩」実装</li>
</ul>

<h2>Ver. 1.4.0 β16 アップロード (2010/08/22 (Sun) 05:01:41)</h2>
<ul>
  <li>システムの文字コードを UTF-8 に変更。</li>
  <li>「白澤」「雪女」「氷妖精」実装</li>
</ul>

<h2>Ver. 1.4.0 β15 アップロード (2010/08/12 (Thu) 05:14:33)</h2>
<ul>
  <li>「急所村」オプション実装</li>
  <li>「冥狼」「冥狐」「座敷童子」「探知師」「夢司祭」「仙人」「獣人」実装</li>
</ul>

<h2>Ver. 1.4.0 β14 アップロード (2010/07/29 (Thu) 05:13:05)</h2>
<ul>
  <li>※覚醒者の子狐コピー結果を星狐から月狐に変更してますが同梱の取説は星狐のままとなっています</li>
  <li>「村人置換村」「蝙蝠村」「キューピッド村」「サブ役職制限」オプション実装</li>
  <li>「夜雀」「吸血鬼」、「会心」「痛恨」「囁耳鳴」「吠耳鳴」「爆睡者」<br>
    「役者」「男性恐怖症」「女性恐怖症」実装</li>
</ul>

<h2>Ver. 1.4.0 β13 アップロード (2010/07/17 (Sat) 19:02:15)</h2>
<ul>
  <li>未投票突然死も死亡欄に表示する仕様に変更</li>
  <li>神話マニア系の所属を神話マニア陣営に移動</li>
  <li>巫女の所属を巫女系に移動</li>
  <li>「蓬莱人形」「蟲狐」「月狐」「星狐」「日妖精」「月妖精」「星妖精」「草妖精」<br>
    「猟師」「辻斬り」「封印師」「風祝」実装</li>
</ul>

<h2>Ver. 1.4.0 β12 アップロード (2010/07/11 (Sun) 07:26:40)</h2>
<ul>
  <li>「超・闇鍋モード」「ゲルト君モード」「オープニングあり」オプション実装</a>
  <li>「餓狼」「占星術師」「境界師」「花妖精」実装</li>
</ul>

<h2>Ver. 1.4.0 β11 アップロード (2010/07/06 (Tue) 03:26:47)</h2>
<ul>
  <li>「魂移使」「覚醒者」「夢語部」「幻狼」「幻狐」「逃亡者」「誘毒者」<br>
    「囁騒霊」「吠騒霊」「念騒霊」「かぐや姫」実装</li>
</ul>
</body></html>
