<?php
define('JINRO_ROOT', '../..');
require_once(JINRO_ROOT . '/include/init.php');
OutputInfoPageHeader('過去の Information', 1);
?>
<h2>Ver. 1.4.0 β4 アップロード (2010/02/24 (Wed) 04:02:36)</h2>
<ul>
  <li>リアルタイム表示 JavaScript の自動補正処理 (時計合わせが不要になります)</li>
  <li>情報一覧ページの再編成</li>
  <li>「暗殺者」「憑狼」登場オプション実装</li>
  <li>「巫女」登場オプションの仕様変更 (狂信者 → 女神)</li>
  <li>ユーザアイコン表示/登録の機能強化</li>
  <li>ユーザ入村画面の改訂</li>
</ul>

<h2>ゲームオプション画像セットアップロード (2010/02/18 (Thu) 00:41:10)</h2>
<ul>
<li>Ver. 1.3 〜 Ver. 1.4.0 β3 に対応 (img/room_option をそのまま差し替えてください)</li>
</ul>

<h2>Ver. 1.4.0 β3 アップロード (2010/02/16 (Tue) 03:53:55)</h2>
<ul>
<li>自動霊界オフオプションの実装</li>
<li>呪狼の仕様変更</li>
</ul>

<h2>Ver. 1.4.0 β2 アップロード (2010/02/08 (Mon) 03:41:23)</h2>
<ul>
<li>預言者、天人、イタコ、仙狸、仙狐の実装</li>
<li>猫又、出題者の仕様変更</li>
<li>再入村リンク表示機能の実装 (設定された時間内、過去ログページに出現します)</li>
</ul>

<h2>Ver. 1.4.0 β1 アップロード (2010/02/02 (Tue) 04:25:52)</h2>
<ul>
<li>Ver. 1.4.0 α24 のバグ Fix、設定ファイルの再配置など</li>
</ul>

<h2>Ver. 1.4.0 α24 アップロード (2010/01/28 (Thu) 21:29:30)</h2>
<ul>
<li>憑狼・紅狼・賢狼・紅狐・黒狐・司祭の実装、抗毒狼の仕様変更など</li>
</ul>

<h2>Ver. 1.4.0 α23 アップロード (2010/01/10 (Sun) 06:11:24)</h2>
<ul>
<li>さとり・銀狼・薬師の仕様変更、鵺・女神の実装など</li>
</ul>
</body></html>
