<?php
define('JINRO_ROOT', '../..');
require_once(JINRO_ROOT . '/include/init.php');
OutputInfoPageHeader('過去の Information', 1);
?>

<h2>Ver. 1.4.0 β8 アップロード (2010/03/28 (Sun) 02:28:28)</h2>
<ul>
  <li>トリップ機能の調整</li>
  <li>入村画面の調整</li>
  <li>「翠狼」「翠狐」「蒼狼」「蒼狐」「金狼」「金狐」「雛狼」「雛狐」<br>
    「天使」「薔薇天使」「百合天使」「大天使」「小悪魔」実装
  </li>
</ul>

<h2>Ver. 1.4.0 β7 アップロード (2010/03/20 (Sat) 20:16:29)</h2>
<ul>
  <li>萌系の変換発動を昼限定に変更</li>
  <li>巫女の恋人後追い判定が正しく出ない事があるバグ修正<br>
    (β6の鵺対応によるエンバグ、誤判定をした場合は「恋人」になる)
  </li>
  <li>サトラレ系の仕様を調整</li>
  <li>蘇生辞退システム実装 (詳細な仕様参照)</li>
  <li>「聖女」「扇動者」「光妖精」「闇妖精」「鏡妖精」実装</li>
</ul>

<h2>Ver. 1.4.0 β6 アップロード (2010/03/12 (Fri) 22:25)</h2>
<ul>
  <li>鵺の所属陣営が正しく出ないバグ修正(修正前は常時村人判定)</li>
  <li>「妖精系」「策士」「亡霊嬢」「毒橋姫」「連毒者」実装</li>
  <li>アイコン情報の編集機能を実装</li>
</ul>

<h2>Ver. 1.4.0 β5 アップロード (2010/03/04 (Thu) 08:10:26)</h2>
<ul>
  <li>長老/古狼/古狐/古蝙蝠 実装 (投票数が +1 にされる、村人/人狼/妖狐/蝙蝠)</li>
  <li>忍者 実装(一度だけ人狼の襲撃に耐えられる狩人)</li>
  <li>ユーザアイコン表示の機能強化</li>
</ul>

<h2>Ver. 1.4.0 β4 アップロード (2010/02/24 (Wed) 04:02:36)</h2>
<ul>
  <li>リアルタイム表示 JavaScript の自動補正処理 (時計合わせが不要になります)</li>
  <li>情報一覧ページの再編成</li>
  <li>「暗殺者」「憑狼」登場オプション実装</li>
  <li>「巫女」登場オプションの仕様変更 (狂信者 → 女神)</li>
  <li>ユーザアイコン表示/登録の機能強化</li>
  <li>ユーザ入村画面の改訂</li>
</ul>

<h2>ゲームオプション画像セットアップロード (2010/02/18 (Thu) 00:41:10)</h2>
<ul>
<li>Ver. 1.3 〜 Ver. 1.4.0 β3 に対応 (img/room_option をそのまま差し替えてください)</li>
</ul>

<h2>Ver. 1.4.0 β3 アップロード (2010/02/16 (Tue) 03:53:55)</h2>
<ul>
<li>自動霊界オフオプションの実装</li>
<li>呪狼の仕様変更</li>
</ul>

<h2>Ver. 1.4.0 β2 アップロード (2010/02/08 (Mon) 03:41:23)</h2>
<ul>
<li>預言者、天人、イタコ、仙狸、仙狐の実装</li>
<li>猫又、出題者の仕様変更</li>
<li>再入村リンク表示機能の実装 (設定された時間内、過去ログページに出現します)</li>
</ul>

<h2>Ver. 1.4.0 β1 アップロード (2010/02/02 (Tue) 04:25:52)</h2>
<ul>
<li>Ver. 1.4.0 α24 のバグ Fix、設定ファイルの再配置など</li>
</ul>

<h2>Ver. 1.4.0 α24 アップロード (2010/01/28 (Thu) 21:29:30)</h2>
<ul>
<li>憑狼・紅狼・賢狼・紅狐・黒狐・司祭の実装、抗毒狼の仕様変更など</li>
</ul>

<h2>Ver. 1.4.0 α23 アップロード (2010/01/10 (Sun) 06:11:24)</h2>
<ul>
<li>さとり・銀狼・薬師の仕様変更、鵺・女神の実装など</li>
</ul>
</body></html>
