<p>
<h1>このサーバについて</h1>
<font color="#FF0000">
ここは「<a href="http://sourceforge.jp/projects/jinrousiki/">人狼式 〜汝は人狼なりや？ 式神研究同好会版</a>」公開テスト専用サーバです。<br>
ログの保全を一切保証しません。<br>
This server is Japanese only. -&gt; <a href="http://sourceforge.jp/projects/jinrousiki/">SourceForge</a>
</font>
</p>

<h1>TOPIC</h1>

<h2>Ver. 1.4.0 β10 アップロード (2010/06/12 (Sat) 19:36:45) → <a href="src/">ダウンロード</a></h2>
<ul>
  <li>探偵村実装</li>
  <li>「人形遣い」「上海人形」「鈴蘭人形」「仏蘭西人形」「探偵」「死神」「司教」実装</li>
</ul>

<h1>開発状況</h1>
<h2>新規実装 / 仕様変更</h2>
<ul>
  <li>魂移使：矢を撃った二人を交換憑依させてしまうキューピッド。</li>
  <li>覚醒者 / 夢語部：4日目にコピー先の上位種 / 基本・劣化種に変化する、特殊な神話マニア。</li>
  <li>幻狼 / 幻狐：一度だけ占い系能力を無効化する、人狼 / 妖狐</li>
  <li>逃亡者：毎晩、生存者の近くに逃亡して生存を図る村人。人狼に見つかると殺される。</li>
  <li>誘毒者：毒能力者にだけ中る埋毒者。</li>
  <li>囁騒霊 / 吠騒霊 / 念騒霊：2日目以降の夜に独り言が共有 / 人狼 / 妖狐にも聞こえるようになる特殊なさとり。</li>
  <li>かぐや姫：自分撃ち固定のキューピッド。自分に受信者、自分と相手に難題が追加される。</li>
</ul>

<h2>現在作成中 / 公開テスト待ち</h2>
<ul>
   <li>なし</li>
</ul>
