<p>
<h1>このサーバについて</h1>
<font color="#FF0000">
ここは「<a href="http://sourceforge.jp/projects/jinrousiki/">人狼式 〜汝は人狼なりや？ 式神研究同好会版</a>」公開テスト専用サーバです。<br>
ログの保全を一切保証しません。<br>
This server is Japanese only. -&gt; <a href="http://sourceforge.jp/projects/jinrousiki/">SourceForge</a>
</font>
</p>

<h1>TOPIC</h1>

<h2>Ver. 1.4.0 β7 アップロード (2010/03/20 (Sat) 20:16:29) → <a href="src/">ダウンロード</a></h2>
<ul>
  <li>萌系の変換発動を昼限定に変更</li>
  <li>巫女の恋人後追い判定が正しく出ない事があるバグ修正<br>
    (β6の鵺対応によるエンバグ、誤判定をした場合は「恋人」になる)
  </li>
  <li>サトラレ系の仕様を調整</li>
  <li>蘇生辞退システム実装 (詳細な仕様参照)</li>
  <li>「聖女」「扇動者」「光妖精」「闇妖精」「鏡妖精」実装</li>
</ul>

<h1>開発状況</h1>
<h2>新規実装 / 仕様変更</h2>
<ul>
  <li>トリップ機能の調整</li>
  <li>翠狼：噛んだ人が狼だった場合に自分と噛んだ人を共鳴者にする</li>
  <li>翠狐：占った人が会話できない妖狐だった場合に自分と占った人を共鳴者にする</li>
  <li>蒼狼：噛んだ人が銀狐以外の噛み殺せない妖狐だった場合にはぐれ者を付加する</li>
  <li>蒼狐：人狼に襲撃されたら襲撃してきた人狼をはぐれ者にする妖狐</li>
  <li>はぐれ者：仲間が分からなくなり、会話できなくなる</li>
</ul>

<h2>現在作成中 / 公開テスト待ち</h2>
<ul>
  <li>金狼：ひよこ鑑定士の判定が蝙蝠になる人狼</li>
  <li>金狐：ひよこ鑑定士の判定が蝙蝠になる妖狐</li>
  <li>雛狐：ひよこ鑑定士の能力を持った子狐</li>
</ul>
