<p>
<h1>このサーバについて</h1>
<font color="#FF0000">
ここは「<a href="http://sourceforge.jp/projects/jinrousiki/">人狼式 〜汝は人狼なりや？ 式神研究同好会版</a>」公開テスト専用サーバです。<br>
ログの保全を一切保証しません。<br>
This server is Japanese only. -&gt; <a href="http://sourceforge.jp/projects/jinrousiki/">SourceForge</a>
</font>
</p>

<h1>TOPIC</h1>

<h2>Ver. 1.4.0 β6 アップロード (2010/03/12 (Fri) 22:25) → <a href="src/">ダウンロード</a></h2>
<ul>
  <li>鵺の所属陣営が正しく出ないバグ修正(修正前は常時村人判定)</li>
  <li>「妖精系」「策士」「亡霊嬢」「毒橋姫」「連毒者」実装</li>
  <li>アイコン情報の編集機能を実装</li>
</ul>

<h1>開発状況</h1>
<h2>新規実装 / 仕様変更</h2>
<ul>
  <li>萌系の変換発動を昼限定に変更</li>
  <li>巫女の恋人後追い判定が正しく出ない事があるバグ修正<br>
    (β6の鵺対応によるエンバグ、誤判定をした場合は「恋人」になる)
  </li>
  <li>サトラレ系の仕様を調整</li>
  <li>「聖女」：村有利の特殊決定者能力を持った村人</li>
  <li>「扇動者」：再投票の最多得票者に投票していたら、最多得票者をまとめて死亡させる狂人</li>
</ul>

<h2>現在作成中 / 公開テスト待ち</h2>
<ul>
  <li>「光妖精」：夜の投票先が人狼に噛まれたら、次の夜を『白夜』(全員公開者) にする妖精</li>
  <li>「闇妖精」：夜の投票先が人狼に噛まれたら、次の昼を『宵闇』(全員目隠し) にする妖精</li>
  <li>「鏡妖精」：吊られたら、初日に投票した二人の決選投票を強制させる妖精</li>
</ul>
