<p>
<h1>このサーバについて</h1>
<font color="#FF0000">
ここは「<a href="http://sourceforge.jp/projects/jinrousiki/">人狼式 〜汝は人狼なりや？ 式神研究同好会版</a>」公開テスト専用サーバです。<br>
ログの保全を一切保証しません。<br>
This server is Japanese only. -&gt; <a href="http://sourceforge.jp/projects/jinrousiki/">SourceForge</a>
</font>
</p>

<h1>TOPIC</h1>

<h2>Ver. 1.4.0 β14 アップロード (2010/07/29 (Thu) 05:13:05) → <a href="src/">ダウンロード</a></h2>
<ul>
  <!-- <li>→ <a href="info/develop/debug.php#140beta14">デバッグ情報</a></li> -->
  <li>※覚醒者の子狐コピー結果を星狐から月狐に変更してますが同梱の取説は星狐のままとなっています</li>
  <li>「村人置換村」「蝙蝠村」「キューピッド村」「サブ役職制限」オプション実装</li>
  <li>「夜雀」「吸血鬼」、「会心」「痛恨」「囁耳鳴」「吠耳鳴」「爆睡者」<br>
    「役者」「男性恐怖症」「女性恐怖症」実装</li>
</ul>

<h1>開発状況</h1>
<h2>新規実装 / 仕様変更</h2>
<ul>
  <li>「急所村」オプション実装</li>
  <li>冥狼 / 冥狐：死の宣告能力を持った人狼 / 妖狐</li>
  <li>座敷童子：役職「村人」の処刑投票数を +1 する村人。吊られたらランダムで一人を「熱病」にする。</li>
  <li>探知師：生存している人が所持しているサブ役職の合計が分かる特殊な司祭。</li>
  <li>夢司祭：生存している夢系・妖精系の合計が分かる特殊な司祭。本人表記は「司祭」。</li>
  <li>仙人：処刑投票した人のショック死を抑制する特殊な薬師。人狼に殺されたら一度だけ蘇生する。</li>
</ul>

<h2>現在作成中 / 公開テスト待ち</h2>
<ul>
  <li>なし</li>
</ul>
