<p>
<h1>このサーバについて</h1>
<font color="#FF0000">
ここは「<a href="http://sourceforge.jp/projects/jinrousiki/">人狼式 〜汝は人狼なりや？ 式神研究同好会版</a>」公開テスト専用サーバです。<br>
ログの保全を一切保証しません。<br>
This server is Japanese only. -&gt; <a href="http://sourceforge.jp/projects/jinrousiki/">SourceForge</a>
</font>
</p>

<h1>TOPIC</h1>

<h2>Ver. 1.4.0 β12 アップロード (2010/07/11 (Sun) 07:26:40) → <a href="src/">ダウンロード</a></h2>
<ul>
  <li>→ <a href="info/develop/debug.php#140beta12">デバッグ情報</a> (2010/07/11 (Sun) 17:14)</li>
  <li>「超・闇鍋モード」「ゲルト君モード」「オープニングあり」オプション実装</a>
  <li>「餓狼」「占星術師」「境界師」「花妖精」実装</li>
</ul>

<h1>開発状況</h1>
<h2>新規実装 / 仕様変更</h2>
<ul>
  <li>未投票突然死も死亡欄に表示する仕様に変更</li>
  <li>神話マニア系の所属を神話マニア陣営に移動</li>
  <li>巫女の所属を巫女系に移動</li>
  <li>蓬莱人形：吊られた時に、自分に投票した人からランダムで一人に死の宣告を付加する人形。</li>
  <li>蟲狐：吊られるか人狼に襲撃されたら熱病を付加する子狐</li>
  <li>月狐：月兎の能力を持つ子狐。一定確率で失敗する。</li>
  <li>星狐：占星術師の能力を持つ子狐。一定確率で失敗する。</li>
  <li>日妖精：投票先が人狼に襲撃されたら、次の日の昼を全員光学迷彩にする妖精。</li>
  <li>月妖精：投票先が人狼に襲撃されたら、次の日の昼を全員耳栓にする妖精。</li>
  <li>星妖精：悪戯が成功すると、星に関するメッセージを死亡メッセージ欄に表示できる妖精。</li>
  <li>草妖精：投票先が人狼に襲撃されたら、次の日の昼を全員草原迷彩にする妖精。</li>
  <li>猟師：妖狐を狩ることができる狩人。護衛先が人狼に襲撃されると自分が死ぬ。</li>
  <li>辻斬り：暗殺した人の役職を知ることができる上位暗殺者。毒能力者を暗殺すると自分が毒死する。</li>
</ul>

<h2>現在作成中 / 公開テスト待ち</h2>
<ul>
  <li>封印師：処刑投票先が回数限定の能力を持っている人外の場合に封じることができる上位巫女。</li>
  <li>風祝：猫又相当の蘇生能力を持った上位巫女。</li>
</ul>
