<p>
<h1>このサーバについて</h1>
<font color="#FF0000">
ここは「<a href="http://sourceforge.jp/projects/jinrousiki/">人狼式 〜汝は人狼なりや？ 式神研究同好会版</a>」公開テスト専用サーバです。<br>
ログの保全を一切保証しません。<br>
This server is Japanese only. -&gt; <a href="http://sourceforge.jp/projects/jinrousiki/">SourceForge</a>
</font>
</p>

<h1>TOPIC</h1>

<h2>Ver. 1.4.0 β8 アップロード (2010/03/28 (Sun) 02:28:28) → <a href="src/">ダウンロード</a></h2>
<ul>
  <li>トリップ機能の調整</li>
  <li>入村画面の調整</li>
  <li>「翠狼」「翠狐」「蒼狼」「蒼狐」「金狼」「金狐」「雛狼」「雛狐」<br>
    「天使」「薔薇天使」「百合天使」「大天使」「小悪魔」実装
  </li>
</ul>

<h1>開発状況</h1>
<h2>新規実装 / 仕様変更</h2>
<ul>
  <li>反魂師：夜に投票した人が生きていたら暗殺、死亡していたら蘇生する特殊な暗殺者</li>
  <li>土蜘蛛：昼に投票した人が吊られなかったら「熱病」にする特殊な狂人</li>
  <li>河童：昼に投票した人を解毒・ショック死抑制する上位薬師</li>
  <li>熱病：表示されている日の昼にショック死する</li>
  <li>自信家：同一陣営の人に投票するとショック死する</li>
</ul>

<h2>現在作成中 / 公開テスト待ち</h2>
<ul>
  <li>死神：投票した相手に死の宣告を付加する暗殺者</li>
  <li>死の宣告：一定日数後に死亡する</li>
</ul>
