<p>
<h1>このサーバについて</h1>
<font color="#FF0000">
ここは「<a href="http://sourceforge.jp/projects/jinrousiki/">人狼式 〜汝は人狼なりや？ 式神研究同好会版</a>」公開テスト専用サーバです。<br>
ログの保全を一切保証しません。<br>
This server is Japanese only. -&gt; <a href="http://sourceforge.jp/projects/jinrousiki/">SourceForge</a>
</font>
</p>

<h1>TOPIC</h1>

<h2>Ver. 1.4.0 β5 アップロード (2010/03/04 (Thu) 08:10:26) → <a href="src/">ダウンロード</a></h2>
<ul>
  <li>長老/古狼/古狐/古蝙蝠 実装 (投票数が +1 にされる、村人/人狼/妖狐/蝙蝠)</li>
  <li>忍者 実装(一度だけ人狼の襲撃に耐えられる狩人)</li>
  <li>ユーザアイコン表示の機能強化</li>
</ul>

<h2>ゲームオプション画像セットアップロード (2010/02/18 (Thu) 00:41:10) → <a href="src/">ダウンロード</a></h2>
<ul>
  <li>Ver. 1.3 〜 Ver. 1.4.0 β3 に対応 (img/room_option をそのまま差し替えてください)</li>
</ul>

<h1>開発状況</h1>
<h2>新規実装 / 仕様変更</h2>
<ul>
  <li>鵺の所属陣営が正しく出ないバグ修正(修正前は常時村人判定)</li>
  <li>策士 (村人陣営以外の人全てから投票されたらまとめて死亡させる共有者)</li>
  <li>妖精 (投票先の発言の先頭に共有者の囁きを付加する、蝙蝠陣営の新種)</li>
  <li>春/夏/秋/冬妖精 (投票先の発言の先頭に季節に関するメッセージを付加する妖精)</li>
  <li>亡霊嬢 (噛んだ人狼に小心者を付加する共有者)</li>
  <li>毒橋姫 (恋人にしか中らない埋毒者)</li>
  <li>連毒者 (毒に中った時のみ、さらに二人巻き込む埋毒者)</li>
  <li>アイコン情報の編集機能を実装</li>
</ul>

<h2>現在作成中 / 公開テスト待ち</h2>
<ul>
  <li>なし</li>
</ul>
