<?php
define('JINRO_ROOT', '../..');
require_once(JINRO_ROOT . '/include/init.php');
OutputInfoPageHeader('開発履歴', 1);
?>
<p>
Ver. 1.4.0
<a href="#140beta1">β1</a>
<a href="#140beta2">β2</a>
<a href="#140beta3">β3</a>
<a href="#140beta4">β4</a>
<a href="#140beta5">β5</a>
<a href="#140beta6">β6</a>
<a href="#140beta7">β7</a>
<a href="#140beta8">β8</a>
<a href="#140beta9">β9</a>
<a href="#140beta10">β10</a>
<a href="#140beta11">β11</a>
<a href="#140beta12">β12</a>
<a href="#140beta13">β13</a>
</p>

<p>
Ver. 1.4.0
<a href="#140alpha1">α1</a>
<a href="#140alpha2">α2</a>
<a href="#140alpha3">α3-6</a>
<a href="#140alpha7">α7</a>
<a href="#140alpha8">α8</a>
<a href="#140alpha9">α9</a>
<a href="#140alpha10">α10</a>
<a href="#140alpha11">α11</a>
<a href="#140alpha12">α12</a>
<a href="#140alpha13">α13</a>
<a href="#140alpha14">α14</a>
<a href="#140alpha15">α15</a>
<a href="#140alpha16">α16</a>
<a href="#140alpha17">α17</a>
<a href="#140alpha18">α18</a>
<a href="#140alpha19">α19</a>
<a href="#140alpha20">α20</a>
<a href="#140alpha21">α21</a>
<a href="#140alpha22">α22</a>
<a href="#140alpha23">α23</a>
<a href="#140alpha24">α24</a>
</p>

<h2><a id="140beta13">Ver. 1.4.0 β13 (Rev. 194) : 2010/07/17 (Sat) 18:40</a></h2>
<ul>
  <li>未投票突然死も死亡欄に表示する仕様に変更</li>
  <li>神話マニア系の所属を神話マニア陣営に移動</li>
  <li>巫女の所属を巫女系に移動</li>
  <li>「蓬莱人形」「蟲狐」「月狐」「星狐」「日妖精」「月妖精」「星妖精」「草妖精」<br>
    「猟師」「辻斬り」「封印師」「風祝」実装</li>
</ul>

<h2><a id="140beta12">Ver. 1.4.0 β12 (Rev. 191) : 2010/07/11 (Sun) 07:04</a></h2>
<ul>
  <li>「超・闇鍋モード」「ゲルト君モード」「オープニングあり」オプション実装</li>
  <li>「餓狼」「占星術師」「境界師」「花妖精」実装</li>
</ul>

<h2><a id="140beta11">Ver. 1.4.0 β11 (Rev. 187) : 2010/07/06 (Tue) 02:55</a></h2>
<ul>
  <li>「魂移使」「覚醒者」「夢語部」「幻狼」「幻狐」「逃亡者」「誘毒者」<br>
    「囁騒霊」「吠騒霊」「念騒霊」「かぐや姫」実装</li>
</ul>

<h2><a id="140beta10">Ver. 1.4.0 β10 (Rev. 184) : 2010/06/12 (Sat) 19:00</a></h2>
<ul>
  <li>探偵村実装</li>
  <li>「人形遣い」「上海人形」「鈴蘭人形」「仏蘭西人形」「探偵」「死神」「司教」実装</li>
</ul>

<h2><a id="140beta9">Ver. 1.4.0 β9 (Rev. 183) : 2010/05/29 (Sat) 04:04</a></h2>
<ul>
  <li>Twitter 投稿機能の実装</li>
  <li>BBS 表示機能の実装</li>
  <li>決闘村の配役変更システムの実装</li>
  <li>「執行者」「反魂師」「蝕暗殺者」「河童」「天狼」「土蜘蛛」「犬神」<br>
    「憑狐」「大蝙蝠」「奇術師」「熱病」「自信家」実装
  </li>
  <li>「夢守人」「夢毒者」「獏」「天狐」「妖精系」の仕様変更</li>
</ul>

<h2><a id="140beta8">Ver. 1.4.0 β8 (Rev. 178) : 2010/03/28 (Sun) 01:48</a></h2>
<ul>
  <li>トリップ機能の調整</li>
  <li>入村画面の調整</li>
  <li>「翠狼」「翠狐」「蒼狼」「蒼狐」「金狼」「金狐」「雛狼」「雛狐」<br>
    「天使」「薔薇天使」「百合天使」「大天使」「小悪魔」実装
  </li>
</ul>

<h2><a id="140beta7">Ver. 1.4.0 β7 (Rev. 176) : 2010/03/20 (Sat) 19:35</a></h2>
<ul>
  <li>萌系の変換発動を昼限定に変更</li>
  <li>巫女の恋人後追い判定が正しく出ない事があるバグ修正<br>
    (β6の鵺対応によるエンバグ、誤判定をした場合は「恋人」になる)
  </li>
  <li>サトラレ系の仕様を調整</li>
  <li>「聖女」「扇動者」「光妖精」「闇妖精」「鏡妖精」実装</li>
  <li>蘇生辞退システム実装</li>
</ul>

<h2><a id="140beta6">Ver. 1.4.0 β6 (Rev. 174) : 2010/03/12 (Fri) 22:25</a></h2>
<ul>
  <li>鵺の所属陣営が正しく出ないバグ修正(修正前は常時村人判定)</li>
  <li>「妖精系」「策士」「亡霊嬢」「毒橋姫」「連毒者」実装</li>
  <li>アイコン情報の編集機能を実装</li>
</ul>

<h2><a id="140beta5">Ver. 1.4.0 β5 (Rev. 171) : 2010/03/04 (Thu) 07:52</a></h2>
<ul>
<li>「長老」「古狼」「古狐」「古蝙蝠」「忍者」実装</li>
<li>情報一覧ページの追加</li>
<li>ユーザアイコン表示の機能強化</li>
</ul>

<h2><a id="140beta4">Ver. 1.4.0 β4 (Rev. 168) : 2010/02/24 (Wed) 03:15</a></h2>
<ul>
<li>リアルタイム表示 JavaScript の自動補正処理 (時計合わせが不要になります)</li>
<li>情報一覧ページの再編成</li>
<li>「暗殺者」「憑狼」登場オプション実装</li>
<li>「巫女」登場オプションの仕様変更 (狂信者 → 女神)</li>
<li>ユーザアイコン表示/登録の機能強化</li>
<li>ユーザ入村画面の改訂</li>
</ul>

<h2><a id="140beta3">Ver. 1.4.0 β3 (Rev. 164) : 2010/02/16 (Tue) 03:14</a></h2>
<ul>
<li>「自動霊界オフ」 オプション実装</li>
<li>ユーザアイコンテーブルにカラムを追加 (入力インターフェイスは未実装)</li>
</ul>

<h2><a id="140beta2">Ver. 1.4.0 β2 (Rev. 157) : 2010/02/08 (Mon) 03:12</a></h2>
<ul>
<li>役職追加</li>
<li>再入村リンクの表示機能実装 (過去ログ)</li>
</ul>

<h2><a id="140beta1">Ver. 1.4.0 β1 (Rev. 152) : 2010/02/02 (Tue) 03:36</a></h2>
<ul>
<li>設定ファイルの配置を変更</li>
</ul>

<h2><a id="140alpha24">Ver. 1.4.0 α24 (Rev. 149) : 2010/01/28 (Thu) 21:15</a></h2>
<ul>
<li>役職追加</li>
<li>初期化処理を再構築</li>
</ul>

<h2><a id="140alpha23">Ver. 1.4.0 α23 (Rev. 140) : 2010/01/10 (Sun) 05:39</a></h2>
<ul>
<li>役職追加</li>
<li>突然死がらみのバグ修正</li>
</ul>

<h2><a id="140alpha22">Ver. 1.4.0 α22 (Rev. 139) : 2010/01/03 (Sun) 07:50</a></h2>
<ul>
<li>役職追加</li>
<li>さとり系のバグ修正</li>
</ul>

<h2><a id="140alpha21">Ver. 1.4.0 α21 (Rev. 138) : 2009/12/27 (Sun) 19:55</a></h2>
<ul>
<li>役職追加</li>
<li>初期化ルーチンを再構築</li>
</ul>

<h2><a id="140alpha20">Ver. 1.4.0 α20 (Rev. 127) : 2009/09/23 (Wed) 05:16</a></h2>
<ul>
<li>役職追加</li>
<li>システムメッセージ周りの改訂</li>
</ul>

<h2><a id="140alpha19">Ver. 1.4.0 α19 (Rev. 123) : 2009/08/26 (Wed) 00:31</a></h2>
<ul>
<li>役職追加</li>
<li>ゲームオプション追加</li>
<li>身代わり君キューピッド対応</li>
</ul>

<h2><a id="140alpha18">Ver. 1.4.0 α18 (Rev. 117) : 2009/08/13 (Thu) 22:27</a></h2>
<ul>
<li>役職追加</li>
<li>夢系の仕様変更</li>
</ul>

<h2><a id="140alpha17">Ver. 1.4.0 α17 (Rev. 105) : 2009/08/02 (Sun) 17:12</a></h2>
<ul>
<li>役職追加</li>
<li>クイズ村調整</li>
</ul>

<h2><a id="140alpha16">Ver. 1.4.0 α16 (Rev. 97) : 2009/07/23 (Thu) 12:25</a></h2>
<ul>
<li>過去ログの表示を調整</li>
</ul>

<h2><a id="140alpha15">Ver. 1.4.0 α15 (Rev. 93) : 2009/07/20 (Mon) 12:14</a></h2>
<ul>
<li>役職追加：波乱万丈、ゴマすり、短気</li>
<li>ゲームオプションの画像追加</li>
</ul>

<h2><a id="140alpha14">Ver. 1.4.0 α14 (Rev. 92) : 2009/07/18 (Sat) 20:42</a></h2>
<ul>
<li>役職追加</li>
</ul>

<h2><a id="140alpha13">Ver. 1.4.0 α13 (Rev. 82) : 2009/07/10 (Fri) 03:15</a></h2>
<ul>
<li>役職追加：舌禍狼、無意識</li>
</ul>

<h2><a id="140alpha12">Ver. 1.4.0 α12 (Rev. 77) : 2009/07/08 (Wed) 03:34</a></h2>
<ul>
<li>役職追加：薬師、毒狼</li>
</ul>

<h2><a id="140alpha11">Ver. 1.4.0 α11 (Rev. 65) : 2009/07/05 (Sun) 19:34</a></h2>
<ul>
<li>役職追加：神話マニア、狼少年</li>
</ul>

<h2><a id="140alpha10">Ver. 1.4.0 α10 (Rev. 57) : 2009/07/04 (Sat) 18:52</a></h2>
<ul>
<li>闇鍋モードの配役ルーチンのバグ修正</li>
<li>霊界の発言で突然死タイマーがリセットされるバグ修正</li>
<li>巫女判定用の画像抜けに対応</li>
</ul>

<h2><a id="140alpha9">Ver. 1.4.0 α9 (Rev. 48) : 2009/07/03 (Fri) 19:25</a></h2>
<ul>
<li>役職追加：不審者、傍観者、疫病神</li>
<li>巫女：恋人後追いにも対応</li>
<li>ショック死のシステムメッセージを変更</li>
<li>子狐の霊能結果が村人になっていたバグ修正</li>
</ul>

<h2><a id="140alpha8">Ver. 1.4.0 α8 (Rev. 37) : 2009/07/02 (Thu) 17:09</a></h2>
<ul>
<li>闇鍋の配役決定ルーチンを組み直し (<a href="../chaos.php">闇鍋モード</a>参照)</li>
<li>魂の占い師の占い結果が正しく表示されないバグ修正</li>
<li>村作成画面のバグ修正 (キューピッドのデフォルトチェック抜け)
</ul>

<h2><a id="140alpha7">Ver. 1.4.0 α7 : 2009/06/30 (Tue) 20:56</a></h2>
<ul>
<li>詳細不明</li>
</ul>

<h2><a id="140alpha3">Ver. 1.4.0 α3〜6</a></h2>
<ul>
<li>役職追加 (詳細不明)</li>
</ul>

<h2><a id="140alpha2">Ver. 1.4.0 α2</a></h2>
<ul>
<li>クイズ村仮実装</li>
<li>闇鍋モード仮実装</li>
</ul>

<h2><a id="140alpha1">Ver. 1.4.0 α1 : 2009/06/26 (Fri) 05:08</a></h2>
<ul>
<li>クイズ村実装開始</li>
<li>闇鍋モード実装開始</li>
</ul>
</body></html>
