<?php
/////////////////////////////////////////////////////////////////////////
// エンコーディングEUC-JP指定 PHPバージョンによって指定方法が異なる    //
/////////////////////////////////////////////////////////////////////////
$php_version = phpversion();
$php_ver_arr = explode(".",$php_version);
if($php_ver_arr[0] <= 4 && $php_ver_arr[1] < 3){ //4.3.x未満
  //	encoding "EUC-JP";  //エラーが出る？？
}
else{ //4.3.x以降
  declare(encoding="EUC-JP");
}

/////////////////////////////////////////////////////////////////////////
// マルチバイト入出力指定                                              //
/////////////////////////////////////////////////////////////////////////
if(extension_loaded("mbstring")){
  mb_language('ja');
  mb_internal_encoding('EUC-JP');
  mb_http_input ('auto');
  mb_http_output('EUC-JP');
}


////////////////////////////////////////////////////////////////////////
//  海外のサーバでも動くようにヘッダ強制指定                          //
//  海外サーバ等で文字化けする場合に指定します。                      //
////////////////////////////////////////////////////////////////////////
// ヘッダがまだ何も送信されていない場合送信する
if(!headers_sent()){
  header('Content-type: text/html; charset=EUC-JP');
  header('Content-Language: ja');
}
?>
